In [2]:
import numpy as np
import pandas as pd

In [3]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
##olmayan(NaN) verileri çıkarmak için,

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [8]:
## kolonu almak için
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [9]:
## bir NaN değeri varsa drop etme, iki NaN değeri varsa drop et

In [10]:
yeniSozlukVerisi = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmir" : [40,39,38], "Antalya" : [45,np.nan, np.nan] }
yeniHavaDurumuDataFrame = pd.DataFrame(yeniSozlukVerisi)

In [12]:
yeniHavaDurumuDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [14]:
## iki tane NaN değeri olan sütunları drop etmek için;
yeniHavaDurumuDataFrame.dropna(axis = 1, thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [15]:
## NaN lara bir değer atamak için;
yeniHavaDurumuDataFrame.fillna(10)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    10.0     39     10.0
2      10.0    25.0     38     10.0